In [6]:
import pandas as pd
from sklearn.model_selection import train_test_split
from sklearn.preprocessing import StandardScaler,LabelEncoder
data = pd.read_csv('Churn_Modelling.csv')
data.head()

   RowNumber  CustomerId   Surname  ...  IsActiveMember EstimatedSalary Exited
0          1    15634602  Hargrave  ...               1       101348.88      1
1          2    15647311      Hill  ...               1       112542.58      0
2          3    15619304      Onio  ...               0       113931.57      1
3          4    15701354      Boni  ...               0        93826.63      0
4          5    15737888  Mitchell  ...               1        79084.10      0

[5 rows x 14 columns]

In [8]:
data.drop(['RowNumber','CustomerId'],axis=1)

        Surname  CreditScore Geography  ... IsActiveMember  EstimatedSalary  Exited
0      Hargrave          619    France  ...              1        101348.88       1
1          Hill          608     Spain  ...              1        112542.58       0
2          Onio          502    France  ...              0        113931.57       1
3          Boni          699    France  ...              0         93826.63       0
4      Mitchell          850     Spain  ...              1         79084.10       0
...         ...          ...       ...  ...            ...              ...     ...
9995   Obijiaku          771    France  ...              0         96270.64       0
9996  Johnstone          516    France  ...              1        101699.77       0
9997        Liu          709    France  ...              1         42085.58       1
9998  Sabbatini          772   Germany  ...              0         92888.52       1
9999     Walker          792    France  ...              0         38190.78       0

[10000 rows x 12 columns]

In [13]:
label_encoder_gender = LabelEncoder()
data['Gender'] = label_encoder_gender.fit_transform(data['Gender'])
data

      RowNumber  CustomerId    Surname  ...  IsActiveMember EstimatedSalary  Exited
0             1    15634602   Hargrave  ...               1       101348.88       1
1             2    15647311       Hill  ...               1       112542.58       0
2             3    15619304       Onio  ...               0       113931.57       1
3             4    15701354       Boni  ...               0        93826.63       0
4             5    15737888   Mitchell  ...               1        79084.10       0
...         ...         ...        ...  ...             ...             ...     ...
9995       9996    15606229   Obijiaku  ...               0        96270.64       0
9996       9997    15569892  Johnstone  ...               1       101699.77       0
9997       9998    15584532        Liu  ...               1        42085.58       1
9998       9999    15682355  Sabbatini  ...               0        92888.52       1
9999      10000    15628319     Walker  ...               0        38190.78       0

[10000 rows x 14 columns]

In [16]:
#onehotencoding ='geography'
from sklearn.preprocessing import OneHotEncoder
onehot_encoder_geo = OneHotEncoder()
geo_encoder = onehot_encoder_geo.fit_transform(data[['Geography']])

In [23]:
geo_encoder

<Compressed Sparse Row sparse matrix of dtype 'float64'
	with 10000 stored elements and shape (10000, 3)>

In [18]:
onehot_encoder_geo.get_feature_names_out(['Geography'])

array(['Geography_France', 'Geography_Germany', 'Geography_Spain'],
      dtype=object)

In [26]:
geo_encoded_df = pd.DataFrame(geo_encoder.toarray(),columns=onehot_encoder_geo.get_feature_names_out(['Geography']))
geo_encoded_df

      Geography_France  Geography_Germany  Geography_Spain
0                  1.0                0.0              0.0
1                  0.0                0.0              1.0
2                  1.0                0.0              0.0
3                  1.0                0.0              0.0
4                  0.0                0.0              1.0
...                ...                ...              ...
9995               1.0                0.0              0.0
9996               1.0                0.0              0.0
9997               1.0                0.0              0.0
9998               0.0                1.0              0.0
9999               1.0                0.0              0.0

[10000 rows x 3 columns]

In [28]:
##combine one hot encoded columns with original columns
data = pd.concat([data.drop('Geography',axis=1),geo_encoded_df],axis=1)
data.head()

   RowNumber  CustomerId  ... Geography_Germany  Geography_Spain
0          1    15634602  ...               0.0              0.0
1          2    15647311  ...               0.0              1.0
2          3    15619304  ...               0.0              0.0
3          4    15701354  ...               0.0              0.0
4          5    15737888  ...               0.0              1.0

[5 rows x 16 columns]

In [31]:
##save encoders
import pickle
with open('label_encoder_gender.pk1','wb') as file:
    pickle.dump(label_encoder_gender,file)

with open('onehot_encoder_geo.pk1','wb') as file:
    pickle.dump(onehot_encoder_geo,file)

In [55]:
#Divide the dataset in to independednt and depenedent feature
from sklearn.compose import ColumnTransformer
X = data.drop(['Exited', 'RowNumber', 'CustomerId', 'Surname'], axis=1)
y = data['Exited']

categorical_cols = X.select_dtypes(include=['object']).columns
numeric_cols = X.select_dtypes(include=['int64', 'float64']).columns
print("Categorical Columns:", categorical_cols)
print("Numeric Columns:", numeric_cols)


# Define the preprocessor
preprocessor = ColumnTransformer(
    transformers=[
        ('num', StandardScaler(), numeric_cols),
        ('cat', OneHotEncoder(drop='first'), categorical_cols)
    ])
 ##Split the data in training and testing sets
X_train, X_test, y_train, y_test  = train_test_split(X,y, test_size=0.2,random_state=42) 


##Scaling features
scaler = StandardScaler()
X_train = scaler.fit_transform(X_train)
X_test = scaler.transform(X_test)

Categorical Columns: Index([], dtype='object')
Numeric Columns: Index(['CreditScore', 'Gender', 'Age', 'Tenure', 'Balance', 'NumOfProducts',
       'HasCrCard', 'IsActiveMember', 'EstimatedSalary', 'Geography_France',
       'Geography_Germany', 'Geography_Spain'],
      dtype='object')

In [52]:
X_train

array([[ 0.35649971,  0.        , -0.6557859 , ...,  1.00150113,
        -0.57946723, -0.57638802],
       [-0.20389777,  0.        ,  0.29493847, ..., -0.99850112,
         1.72572313, -0.57638802],
       [-0.96147213,  0.        , -1.41636539, ..., -0.99850112,
        -0.57946723,  1.73494238],
       ...,
       [ 0.86500853,  0.        , -0.08535128, ...,  1.00150113,
        -0.57946723, -0.57638802],
       [ 0.15932282,  0.        ,  0.3900109 , ...,  1.00150113,
        -0.57946723, -0.57638802],
       [ 0.47065475,  0.        ,  1.15059039, ..., -0.99850112,
         1.72572313, -0.57638802]])

In [56]:
with open('scaler.pk1','wb') as file:
    pickle.dump(scaler,file)

ANN Implementation

In [58]:
import tensorflow as tf
from tensorflow.keras.models import Sequential
from tensorflow.keras.layers import Dense
import datetime

In [68]:
##build our ANN model
model = Sequential([
    Dense(64, activation ='relu', input_shape= (X_train.shape[1],)),
    Dense(32,activation ='relu'),
    Dense(1,activation='sigmoid')
])

In [71]:
model.summary()

Model: "sequential"
_________________________________________________________________
 Layer (type)                Output Shape              Param #
=================================================================
 dense (Dense)               (None, 64)                832

 dense_1 (Dense)             (None, 32)                2080

 dense_2 (Dense)             (None, 1)                 33

=================================================================
Total params: 2945 (11.50 KB)
Trainable params: 2945 (11.50 KB)
Non-trainable params: 0 (0.00 Byte)
_________________________________________________________________

In [ ]:
model.compile(optimizer="",loss= 'binary_crossentrophy', metric=['accuracy'])

In [77]:
opt = tf.keras.optimizers.legacy.Adam(learning_rate =0.01)
tf.keras.losses.binary_crossentropy()

TypeError: Missing required positional argument